{
        "name": "7d210.Trojan_Mitigations",
        "versions": {
                "attack": "14",
                "navigator": "4.9.1",
                "layer": "4.5"
        },
        "domain": "enterprise-attack",
        "description": "",
        "filters": {
                "platforms": [
                        "Linux",
                        "macOS",
                        "Windows",
                        "Office 365",
                        "Azure AD",
                        "AWS",
                        "GCP",
                        "Azure",
                        "SaaS",
                        "PRE",
                        "Network"
                ]
        },
        "sorting": 0,
        "layout": {
                "layout": "flat",
                "showID": false,
                "showName": true
        },
        "hideDisabled": false,
        "techniques": [
                {
                        "techniqueID": "T1129-M1038\nIdentify and block potentially malicious software executed through this technique by using application control tools capable of preventing unknown DLLs from being loaded.\n\nT1106-M1038\nIdentify and block potentially malicious software executed that may be executed through this technique by using application control  tools",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "like Windows Defender Application Control",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "AppLocker",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "or Software Restriction Policies  where appropriate. \n\nT1059.003-M1038\nUse application control where appropriate.\n\nT1047-M1026\nPrevent credential overlap across systems of administrator and privileged accounts. \n\nT1047-M1018\nBy default",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "only administrators are allowed to connect remotely using WMI. Restrict other users who are allowed to connect",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "or disallow all users to connect remotely to WMI.\n\nT1543-M1047\nUse auditing tools capable of detecting privilege and service abuse opportunities on systems within an enterprise and correct them.\n\nT1543-M1033\nRestrict software installation to trusted repositories only and be cautious of orphaned software packages.\n\nT1543-M1022\nRestrict read/write access to system-level process files to only select privileged users who have a legitimate need to manage system services.\n\nT1543-M1018\nLimit privileges of user accounts and groups so that only authorized administrators can interact with system-level process changes and service configurations.\n\nT1543.003-M1047\nUse auditing tools capable of detecting privilege and service abuse opportunities on systems within an enterprise and correct them.\n\nT1543.003-M1018\nLimit privileges of user accounts and groups so that only authorized administrators can interact with service changes and service configurations.\n\nT1055.003-M1040\nSome endpoint security solutions can be configured to block some types of process injection based on common sequences of behavior that occur during the injection process.\n\nT1055-M1040\nSome endpoint security solutions can be configured to block some types of process injection based on common sequences of behavior that occur during the injection process.\n\nT1055-M1026\nUtilize Yama (ex: /proc/sys/kernel/yama/ptrace_scope) to mitigate ptrace based process injection by restricting the use of ptrace to privileged users only. Other mitigation controls involve the deployment of security kernel modules that provide advanced access control and process restrictions such as SELinux",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "grsecurity",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "and AppArmor.\n\nT1055.001-M1040\nSome endpoint security solutions can be configured to block some types of process injection based on common sequences of behavior that occur during the injection process.\n\nT1055.011-M1040\nSome endpoint security solutions can be configured to block some types of process injection based on common sequences of behavior that occur during the injection process.\n\nT1027-M1049\nConsider utilizing the Antimalware Scan Interface (AMSI) on Windows 10 to analyze commands after being processed/interpreted\n\nT1112-M1024\nEnsure proper permissions are set for Registry hives to prevent users from modifying keys for system components that may lead to privilege escalation.\n\nT1027.002-M1049\nEmploy heuristic-based malware detection. Ensure updated virus definitions and create custom signatures for observed malware.\n\nT1564.003-M1038\nLimit or restrict program execution using anti-virus software. On MacOS",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "allowlist programs that are allowed to have the plist tag. All other programs should be considered suspicious.\n\nT1480-M1055\nExecution Guardrails likely should not be mitigated with preventative controls because it may protect unintended targets from being compromised. If targeted",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "efforts should be focused on preventing adversary tools from running earlier in the chain of activity and on identifying subsequent malicious behavior if compromised.\n\nT1213-M1047\nConsider periodic review of accounts and privileges for critical and sensitive repositories.\n\nT1213-M1018\nEnforce the principle of least-privilege. Consider implementing access control mechanisms that include both authentication and authorization.\n\nT1213-M1017\nDevelop and publish policies that define acceptable information to be stored in repositories.\n\nT1071-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware can be used to mitigate activity at the network level.\n\nT1571-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware can be used to mitigate activity at the network level.\n\nT1571-M1030\nProperly configure firewalls and proxies to limit outgoing traffic to only necessary ports for that particular network segment.\n\nT1573-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware can be used to mitigate activity at the network level.\n\nT1573-M1020\nSSL/TLS inspection can be used to see the contents of encrypted sessions to look for network-based indicators of malware communication protocols.\n\nT1105-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware or unusual data transfer over known tools and protocols like FTP can be used to mitigate activity at the network level. Signatures are often for unique indicators within protocols and may be based on the specific obfuscation technique used by a particular adversary or tool",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "and will likely be different across various malware families and versions. Adversaries will likely change tool C2 signatures over time or construct protocols in such a way as to avoid detection by common defensive tools.\n\nT1090-M1037\nTraffic to known anonymity networks and C2 infrastructure can be blocked through the use of network allow and block lists. It should be noted that this kind of blocking may be circumvented by other techniques like Domain Fronting.\n\nT1090-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware can be used to mitigate activity at the network level. Signatures are often for unique indicators within protocols and may be based on the specific C2 protocol used by a particular adversary or tool",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "and will likely be different across various malware families and versions. Adversaries will likely change tool C2 signatures over time or construct protocols in such a way as to avoid detection by common defensive tools. \n\nT1090-M1020\nIf it is possible to inspect HTTPS traffic",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "the captures can be analyzed for connections that appear to be domain fronting.\n\nT1071.001-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware can be used to mitigate activity at the network level.\n\nT1573.001-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware can be used to mitigate activity at the network level.\n\nT1029-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary command and control infrastructure and malware can be used to mitigate activity at the network level. Signatures are often for unique indicators within protocols and may be based on the specific obfuscation technique used by a particular adversary or tool",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "and will likely be different across various malware families and versions. Adversaries will likely change tool command and control signatures over time or construct protocols in such a way to avoid detection by common defensive tools. \n\nT1489-M1030\nOperate intrusion detection",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "analysis",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "and response systems on a separate network from the production environment to lessen the chances that an adversary can see and interfere with critical response functions.\n\nT1489-M1022\nEnsure proper process and file permissions are in place to inhibit adversaries from disabling or interfering with critical services.\n\nT1489-M1024\nEnsure proper registry permissions are in place to inhibit adversaries from disabling or interfering with critical services.\n\nT1489-M1018\nLimit privileges of user accounts and groups so that only authorized administrators can interact with service changes and service configurations.",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                }
        ],
        "gradient": {
                "colors": [
                        "#ff6666",
                        "#ffe766",
                        "#8ec843"
                ],
                "minValue": 0,
                "maxValue": 100
        },
        "legendItems": [],
        "metadata": [],
        "showTacticRowBackground": false,
        "tacticRowBackground": "#dddddd",
        "selectTechniquesAcrossTactics": true,
        "selectSubtechniquesWithParent": false
}