{
        "name": "dad66.Trojan_Mitigations",
        "versions": {
                "attack": "14",
                "navigator": "4.9.1",
                "layer": "4.5"
        },
        "domain": "enterprise-attack",
        "description": "",
        "filters": {
                "platforms": [
                        "Linux",
                        "macOS",
                        "Windows",
                        "Office 365",
                        "Azure AD",
                        "AWS",
                        "GCP",
                        "Azure",
                        "SaaS",
                        "PRE",
                        "Network"
                ]
        },
        "sorting": 0,
        "layout": {
                "layout": "flat",
                "showID": false,
                "showName": true
        },
        "hideDisabled": false,
        "techniques": [
                {
                        "techniqueID": "T1129-M1038\nIdentify and block potentially malicious software executed through this technique by using application control tools capable of preventing unknown DLLs from being loaded.\n\nT1106-M1038\nIdentify and block potentially malicious software executed that may be executed through this technique by using application control  tools",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "like Windows Defender Application Control",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "AppLocker",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "or Software Restriction Policies  where appropriate. \n\nT1204.002-M1038\nApplication control may be able to prevent the running of executables masquerading as other files.\n\nT1204.002-M1017\nUse user training as a way to bring awareness to common phishing and spearphishing techniques and how to raise suspicion for potentially malicious events.\n\nT1574.002-M1013\nWhen possible",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "include hash values in manifest files to help prevent side-loading of malicious libraries.\n\nT1574.002-M1051\nUpdate software regularly to include patches that fix DLL side-loading vulnerabilities.\n\nT1543.003-M1047\nUse auditing tools capable of detecting privilege and service abuse opportunities on systems within an enterprise and correct them.\n\nT1543.003-M1018\nLimit privileges of user accounts and groups so that only authorized administrators can interact with service changes and service configurations.\n\nT1543-M1047\nUse auditing tools capable of detecting privilege and service abuse opportunities on systems within an enterprise and correct them.\n\nT1543-M1033\nRestrict software installation to trusted repositories only and be cautious of orphaned software packages.\n\nT1543-M1022\nRestrict read/write access to system-level process files to only select privileged users who have a legitimate need to manage system services.\n\nT1543-M1018\nLimit privileges of user accounts and groups so that only authorized administrators can interact with system-level process changes and service configurations.\n\nT1055-M1040\nSome endpoint security solutions can be configured to block some types of process injection based on common sequences of behavior that occur during the injection process.\n\nT1055-M1026\nUtilize Yama (ex: /proc/sys/kernel/yama/ptrace_scope) to mitigate ptrace based process injection by restricting the use of ptrace to privileged users only. Other mitigation controls involve the deployment of security kernel modules that provide advanced access control and process restrictions such as SELinux",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "grsecurity",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "and AppArmor.\n\nT1055.003-M1040\nSome endpoint security solutions can be configured to block some types of process injection based on common sequences of behavior that occur during the injection process.\n\nT1055.004-M1040\nSome endpoint security solutions can be configured to block some types of process injection based on common sequences of behavior that occur during the injection process.\n\nT1134-M1026\nLimit permissions so that users and user groups cannot create tokens. This setting should be defined for the local system account only. GPO: Computer Configuration > [Policies] > Windows Settings > Security Settings > Local Policies > User Rights Assignment: Create a token object.  Also define who can create a process level token to only the local and network service through GPO: Computer Configuration > [Policies] > Windows Settings > Security Settings > Local Policies > User Rights Assignment: Replace a process level token. Administrators should log in as a standard user but run their tools with administrator privileges using the built-in access token manipulation command runas.\n\nT1134-M1018\nAn adversary must already have administrator level access on the local system to make full use of this technique; be sure to restrict users and accounts to the least privileges they require.\n\nT1134.001-M1026\nLimit permissions so that users and user groups cannot create tokens. This setting should be defined for the local system account only. GPO: Computer Configuration > [Policies] > Windows Settings > Security Settings > Local Policies > User Rights Assignment: Create a token object.  Also define who can create a process level token to only the local and network service through GPO: Computer Configuration > [Policies] > Windows Settings > Security Settings > Local Policies > User Rights Assignment: Replace a process level token. Administrators should log in as a standard user but run their tools with administrator privileges using the built-in access token manipulation command runas.\n\nT1134.001-M1018\nAn adversary must already have administrator level access on the local system to make full use of this technique; be sure to restrict users and accounts to the least privileges they require.\n\nT1055.001-M1040\nSome endpoint security solutions can be configured to block some types of process injection based on common sequences of behavior that occur during the injection process.\n\nT1055.011-M1040\nSome endpoint security solutions can be configured to block some types of process injection based on common sequences of behavior that occur during the injection process.\n\nT1027-M1049\nConsider utilizing the Antimalware Scan Interface (AMSI) on Windows 10 to analyze commands after being processed/interpreted\n\nT1112-M1024\nEnsure proper permissions are set for Registry hives to prevent users from modifying keys for system components that may lead to privilege escalation.\n\nT1562.001-M1022\nEnsure proper process and file permissions are in place to prevent adversaries from disabling or interfering with security services.\n\nT1562.001-M1024\nEnsure proper Registry permissions are in place to prevent adversaries from disabling or interfering with security services.\n\nT1562.001-M1018\nEnsure proper user permissions are in place to prevent adversaries from disabling or interfering with security services.\n\nT1222-M1026\nEnsure critical system files as well as those known to be abused by adversaries have restrictive permissions and are owned by an appropriately privileged account",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "especially if access is not required by users nor will inhibit system functionality.\n\nT1222-M1022\nApplying more restrictive permissions to files and directories could prevent adversaries from modifying the access control lists.\n\nT1564.003-M1038\nLimit or restrict program execution using anti-virus software. On MacOS",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "allowlist programs that are allowed to have the plist tag. All other programs should be considered suspicious.\n\nT1027.002-M1049\nEmploy heuristic-based malware detection. Ensure updated virus definitions and create custom signatures for observed malware.\n\nT1480-M1055\nExecution Guardrails likely should not be mitigated with preventative controls because it may protect unintended targets from being compromised. If targeted",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "efforts should be focused on preventing adversary tools from running earlier in the chain of activity and on identifying subsequent malicious behavior if compromised.\n\nT1119-M1041\nEncryption and off-system storage of sensitive information may be one way to mitigate collection of files",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "but may not stop an adversary from acquiring the information if an intrusion persists over a long period of time and the adversary is able to discover and access the data through other means. Strong passwords should be used on certain encrypted documents that use them to prevent offline cracking through Brute Force techniques.\n\nT1119-M1029\nEncryption and off-system storage of sensitive information may be one way to mitigate collection of files",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "but may not stop an adversary from acquiring the information if an intrusion persists over a long period of time and the adversary is able to discover and access the data through other means.\n\nT1105-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware or unusual data transfer over known tools and protocols like FTP can be used to mitigate activity at the network level. Signatures are often for unique indicators within protocols and may be based on the specific obfuscation technique used by a particular adversary or tool",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "and will likely be different across various malware families and versions. Adversaries will likely change tool C2 signatures over time or construct protocols in such a way as to avoid detection by common defensive tools.\n\nT1573.002-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware can be used to mitigate activity at the network level.\n\nT1573.002-M1020\nSSL/TLS inspection can be used to see the contents of encrypted sessions to look for network-based indicators of malware communication protocols.\n\nT1071-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware can be used to mitigate activity at the network level.\n\nT1071.001-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware can be used to mitigate activity at the network level.\n\nT1573-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware can be used to mitigate activity at the network level.\n\nT1573-M1020\nSSL/TLS inspection can be used to see the contents of encrypted sessions to look for network-based indicators of malware communication protocols.\n\nT1071.004-M1037\nConsider filtering DNS requests to unknown",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "untrusted",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "or known bad domains and resources. Resolving DNS requests with on-premise/proxy servers may also disrupt adversary attempts to conceal data within DNS packets.\n\nT1071.004-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware can be used to mitigate activity at the network level.\n\nT1573.001-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary malware can be used to mitigate activity at the network level.\n\nT1029-M1031\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary command and control infrastructure and malware can be used to mitigate activity at the network level. Signatures are often for unique indicators within protocols and may be based on the specific obfuscation technique used by a particular adversary or tool",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "and will likely be different across various malware families and versions. Adversaries will likely change tool command and control signatures over time or construct protocols in such a way to avoid detection by common defensive tools. \n\nT1486-M1053\nConsider implementing IT disaster recovery plans that contain procedures for regularly taking and testing data backups that can be used to restore organizational data. Ensure backups are stored off system and is protected from common methods adversaries may use to gain access and destroy the backups to prevent recovery. Consider enabling versioning in cloud environments to maintain backup copies of storage objects.\n\nT1489-M1030\nOperate intrusion detection",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "analysis",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                },
                {
                        "techniqueID": "and response systems on a separate network from the production environment to lessen the chances that an adversary can see and interfere with critical response functions.\n\nT1489-M1022\nEnsure proper process and file permissions are in place to inhibit adversaries from disabling or interfering with critical services.\n\nT1489-M1024\nEnsure proper registry permissions are in place to inhibit adversaries from disabling or interfering with critical services.\n\nT1489-M1018\nLimit privileges of user accounts and groups so that only authorized administrators can interact with service changes and service configurations.",
                        "color": "#e60d0d",
                        "comment": "",
                        "enabled": true,
                        "metadata": [],
                        "showSubtechniques": true
                }
        ],
        "gradient": {
                "colors": [
                        "#ff6666",
                        "#ffe766",
                        "#8ec843"
                ],
                "minValue": 0,
                "maxValue": 100
        },
        "legendItems": [],
        "metadata": [],
        "showTacticRowBackground": false,
        "tacticRowBackground": "#dddddd",
        "selectTechniquesAcrossTactics": true,
        "selectSubtechniquesWithParent": false
}